deleted on console, then apply

```
 terraform apply
2020/08/28 11:24:27 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
data.tencentcloud_vpc_instances.foo: Refreshing state...
tencentcloud_vpn_customer_gateway.cgw: Refreshing state... [id=cgw-8u5l4jq7]
tencentcloud_vpn_gateway.vpn: Refreshing state... [id=vpngw-8xjyjib7]
tencentcloud_vpn_connection.connection: Refreshing state... [id=vpnx-iofbrwbo]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_vpn_connection.connection will be created
  + resource "tencentcloud_vpn_connection" "connection" {
      + create_time                = (known after apply)
      + customer_gateway_id        = (known after apply)
      + encrypt_proto              = (known after apply)
      + id                         = (known after apply)
      + ike_dh_group_name          = "GROUP1"
      + ike_exchange_mode          = "MAIN"
      + ike_local_address          = (known after apply)
      + ike_local_identity         = "ADDRESS"
      + ike_proto_authen_algorithm = "MD5"
      + ike_proto_encry_algorithm  = "3DES-CBC"
      + ike_remote_address         = "3.3.3.3"
      + ike_remote_identity        = "ADDRESS"
      + ike_sa_lifetime_seconds    = 86400
      + ike_version                = "IKEV1"
      + ipsec_encrypt_algorithm    = "3DES-CBC"
      + ipsec_integrity_algorithm  = "MD5"
      + ipsec_pfs_dh_group         = "DH-GROUP1"
      + ipsec_sa_lifetime_seconds  = 3600
      + ipsec_sa_lifetime_traffic  = 2560
      + is_ccn_type                = (known after apply)
      + name                       = "vpn_connection_test"
      + net_status                 = (known after apply)
      + pre_share_key              = "test"
      + route_type                 = (known after apply)
      + state                      = (known after apply)
      + tags                       = {
          + "test" = "test"
        }
      + vpc_id                     = "vpc-h70b6b49"
      + vpn_gateway_id             = (known after apply)
      + vpn_proto                  = (known after apply)

      + security_group_policy {
          + local_cidr_block  = "10.31.64.0/24"
          + remote_cidr_block = [
              + "3.3.3.0/32",
            ]
        }
      + security_group_policy {
          + local_cidr_block  = "172.16.0.0/16"
          + remote_cidr_block = [
              + "3.3.3.0/32",
            ]
        }
    }

  # tencentcloud_vpn_customer_gateway.cgw will be created
  + resource "tencentcloud_vpn_customer_gateway" "cgw" {
      + create_time       = (known after apply)
      + id                = (known after apply)
      + name              = "terraform_test"
      + public_ip_address = "3.3.3.3"
    }

  # tencentcloud_vpn_gateway.vpn will be created
  + resource "tencentcloud_vpn_gateway" "vpn" {
      + bandwidth          = 5
      + charge_type        = "POSTPAID_BY_HOUR"
      + create_time        = (known after apply)
      + expired_time       = (known after apply)
      + id                 = (known after apply)
      + is_address_blocked = (known after apply)
      + name               = "terraform_update"
      + new_purchase_plan  = (known after apply)
      + prepaid_period     = 1
      + prepaid_renew_flag = "NOTIFY_AND_AUTO_RENEW"
      + public_ip_address  = (known after apply)
      + restrict_state     = (known after apply)
      + state              = (known after apply)
      + tags               = {
          + "test" = "test"
        }
      + type               = (known after apply)
      + vpc_id             = "vpc-h70b6b49"
      + zone               = "ap-guangzhou-3"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_vpn_customer_gateway.cgw: Creating...
tencentcloud_vpn_gateway.vpn: Creating...
tencentcloud_vpn_customer_gateway.cgw: Creation complete after 1s [id=cgw-ekq5abtn]
tencentcloud_vpn_gateway.vpn: Still creating... [10s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [20s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [30s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [40s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [50s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [1m0s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [1m10s elapsed]
tencentcloud_vpn_gateway.vpn: Still creating... [1m20s elapsed]
tencentcloud_vpn_gateway.vpn: Creation complete after 1m21s [id=vpngw-aiziwr7b]
tencentcloud_vpn_connection.connection: Creating...
tencentcloud_vpn_connection.connection: Creation complete after 6s [id=vpnx-mx0jeesm]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.


```